# Taps
tap 'caskroom/versions'
tap 'homebrew/dupes'

# Brew formulas
brew 'bash'
brew 'coreutils'
brew 'emacs', args: ['with-cocoa']
brew 'findutils', args: ['with-default-names']
brew 'gist'
brew 'git'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'hub'
brew 'ngrok'
brew 'p7zip'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Install casks
cask 'bowtie'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome-canary'
cask 'iterm2-beta'
cask 'karabiner'
cask 'opera'
cask 'skype'
cask 'sourcetree'
cask 'textual'
cask 'the-unarchiver'
