# Taps
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'neovim/neovim'

# Brew formulas
brew 'bash'
brew 'coreutils'
brew 'emacs', args: ['with-cocoa']
brew 'gist'
brew 'git'
brew 'hub'
brew 'neovim/neovim/neovim'
brew 'p7zip'
brew 'pandoc'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Install casks
cask 'bowtie'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome-canary'
cask 'imageoptim'
cask 'iterm2-beta'
cask 'karabiner'
cask 'ngrok'
cask 'opera'
cask 'skype'
cask 'sourcetree'
cask 'spectacle'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'

# Install QuickLook plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
