# Taps
tap 'caskroom/versions'
tap 'homebrew/dupes'

# Brew formulas
brew 'bash'
brew 'coreutils'
brew 'gist'
brew 'git'
brew 'hub'
brew 'neovim'
brew 'node'
brew 'p7zip'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'subliminal'
brew 'svtplay-dl'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Install casks
cask 'bowtie'
cask 'discord'
cask 'dropbox'
cask 'emacs'
cask 'eqmac'
cask 'exodus'
cask 'firefox'
cask 'flux'
cask 'google-chrome-canary'
cask 'imageoptim'
cask 'iterm2-beta'
cask 'karabiner'
cask 'kodi'
cask 'ngrok'
cask 'nzbget'
cask 'opera'
cask 'sonarr'
cask 'sourcetree'
cask 'spectacle'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# Install QuickLook plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
